app/Controllers/Admin/CategoryController.php

    public function index()
    {
        return view('admin/categories', [
            'categories' => (new CategoryModel())->where('deleted_at IS NULL')->findAll(),
        ]);
---
SELECT *
FROM `categories`
WHERE `deleted_at` IS NULL
AND `categories`.`deleted_at` IS NULL