app/Controllers/Admin/DashboardController.php

    public function index()
    {
        $orderModel   = new OrderModel();
        $productModel = new ProductModel();

        $pendingOrders  = count($orderModel->where('status_pesanan', 'pending')->findAll());
        $todayRevenue   = $this->getTodayRevenue();
        $monthRevenue   = $this->getMonthRevenue();
        $lowStockItems  = $productModel->getLowStock(5);
        $recentOrders   = $this->db->table('orders o')
            ->select('o.*, u.nama as nama_customer')
            ->join('users u', 'u.id = o.user_id', 'left')
            ->orderBy('o.created_at', 'DESC')
            ->limit(10)
            ->get()->getResultArray();
---
SELECT *
FROM `orders`
WHERE `status_pesanan` = 'pending'
SELECT `o`.*, `u`.`nama` as `nama_customer`
FROM `orders` `o`
LEFT JOIN `users` `u` ON `u`.`id` = `o`.`user_id`
ORDER BY `o`.`created_at` DESC
 LIMIT 10

    private function getTodayRevenue(): float
    {
        $row = $this->db->table('orders')
            ->selectSum('total_bayar')
            ->where('status_pesanan', 'selesai')
            ->where('DATE(updated_at)', date('Y-m-d'))
            ->get()->getRowArray();
---
SELECT SUM(`total_bayar`) AS `total_bayar`
FROM `orders`
WHERE `status_pesanan` = 'selesai'
AND DATE(updated_at) = '2026-06-16'

    private function getMonthRevenue(): float
    {
        $row = $this->db->table('orders')
            ->selectSum('total_bayar')
            ->where('status_pesanan', 'selesai')
            ->where('MONTH(updated_at)', date('m'))
            ->where('YEAR(updated_at)', date('Y'))
            ->get()->getRowArray();
---
SELECT SUM(`total_bayar`) AS `total_bayar`
FROM `orders`
WHERE `status_pesanan` = 'selesai'
AND MONTH(updated_at) = '06'
AND YEAR(updated_at) = '2026'