app/Controllers/Admin/PetugasController.php

SELECT *
FROM `users`
WHERE `role` = 'petugas'
AND `deleted_at` IS NULL
AND `users`.`deleted_at` IS NULL
ORDER BY `created_at` DESC
---
    public function index()
    {
        return view('admin/petugas', [
            'list' => (new UserModel())
                ->where('role', 'petugas')
                ->where('deleted_at IS NULL')
                ->orderBy('created_at', 'DESC')
                ->findAll(),
        ]);