app/Controllers/Admin/PrintPricingController.php

    public function index()
    {
        return view('admin/print_pricing', [
            'pricings' => (new PrintPricingModel())->findAll(),
        ]);
---
SELECT *
FROM `print_pricing`