app/Controllers/Admin/PrintAdminController.php

SELECT `o`.*, `u`.`nama` as `nama_customer`, `po`.`jumlah_halaman`, `po`.`jumlah_halaman_terverifikasi`, `po`.`jenis_kertas`
FROM `orders` `o`
LEFT JOIN `users` `u` ON `u`.`id` = `o`.`user_id`
LEFT JOIN `print_orders` `po` ON `po`.`order_id` = `o`.`id`
WHERE `o`.`tipe_pesanan` = 'print'
ORDER BY `o`.`created_at` DESC
---
    public function index()
    {
        $orders = $this->db->table('orders o')
            ->select('o.*, u.nama as nama_customer, po.jumlah_halaman, po.jumlah_halaman_terverifikasi, po.jenis_kertas')
            ->join('users u', 'u.id = o.user_id', 'left')
            ->join('print_orders po', 'po.order_id = o.id', 'left')
            ->where('o.tipe_pesanan', 'print')
            ->orderBy('o.created_at', 'DESC')
            ->get()->getResultArray();