app/Controllers/Admin/ReportController.php

SELECT DATE(updated_at) as tanggal, SUM(total_bayar) as total
FROM `orders`
WHERE `status_pesanan` = 'selesai'
AND MONTH(updated_at) = '06'
AND YEAR(updated_at) = '2026'
GROUP BY DATE(updated_at)
ORDER BY `tanggal` ASC
---
    private function getDailyRevenue(string $year, string $month): array
    {
        return $this->db->table('orders')
            ->select('DATE(updated_at) as tanggal, SUM(total_bayar) as total')
            ->where('status_pesanan', 'selesai')
            ->where('MONTH(updated_at)', $month)
            ->where('YEAR(updated_at)', $year)
            ->groupBy('DATE(updated_at)')
            ->orderBy('tanggal', 'ASC')
            ->get()->getResultArray();

SELECT MONTH(updated_at) as bulan, SUM(total_bayar) as total
FROM `orders`
WHERE `status_pesanan` = 'selesai'
AND YEAR(updated_at) = '2026'
GROUP BY MONTH(updated_at)
ORDER BY `bulan` ASC
---
    private function getMonthlyRevenue(string $year): array
    {
        return $this->db->table('orders')
            ->select('MONTH(updated_at) as bulan, SUM(total_bayar) as total')
            ->where('status_pesanan', 'selesai')
            ->where('YEAR(updated_at)', $year)
            ->groupBy('MONTH(updated_at)')
            ->orderBy('bulan', 'ASC')
            ->get()->getResultArray();