app/Models/NotificationModel.php

SELECT COUNT(*) AS `numrows`
FROM `notifications`
WHERE `user_id` = 1
AND `is_read` = 0
---
    public function getUnreadCount(int $userId): int
    {
        return $this->where('user_id', $userId)->where('is_read', 0)->countAllResults();