app/Models/OrderModel.php

SELECT `o`.*, `u`.`nama` as `nama_customer`, `u`.`email` as `email_customer`
FROM `orders` `o`
LEFT JOIN `users` `u` ON `u`.`id` = `o`.`user_id`
ORDER BY `o`.`created_at` DESC
---
    public function getAll(array $filters = []): array
    {
        $builder = $this->db->table('orders o')
            ->select('o.*, u.nama as nama_customer, u.email as email_customer')
            ->join('users u', 'u.id = o.user_id', 'left')
            ->orderBy('o.created_at', 'DESC');

        if (!empty($filters['status'])) {
            $builder->where('o.status_pesanan', $filters['status']);
        }

        if (!empty($filters['tipe'])) {
            $builder->where('o.tipe_pesanan', $filters['tipe']);
        }

        if (!empty($filters['search'])) {
            $builder->groupStart()
                ->like('o.invoice_code', $filters['search'])
                ->orLike('u.nama', $filters['search'])
                ->orLike('u.email', $filters['search'])
                ->groupEnd();
        }

        return $builder->get()->getResultArray();