app/Models/ProductModel.php

    public function getLowStock(int $threshold = 5): array
    {
        return $this->where('stok <=', $threshold)->where('deleted_at IS NULL')->findAll();
---
SELECT *
FROM `products`
WHERE `stok` <= 5
AND `deleted_at` IS NULL
AND `products`.`deleted_at` IS NULL

    public function getTopSelling(int $limit = 10): array
    {
        return $this->db->table('order_items oi')
            ->select('p.id, p.nama_produk, SUM(oi.qty) as total_terjual')
            ->join('products p', 'p.id = oi.product_id', 'left')
            ->join('orders o', 'o.id = oi.order_id', 'left')
            ->where('o.status_pesanan', 'selesai')
            ->where('p.deleted_at IS NULL')
            ->groupBy('p.id')
            ->orderBy('total_terjual', 'DESC')
            ->limit($limit)
            ->get()->getResultArray();
---
SELECT `p`.`id`, `p`.`nama_produk`, SUM(oi.qty) as total_terjual
FROM `order_items` `oi`
LEFT JOIN `products` `p` ON `p`.`id` = `oi`.`product_id`
LEFT JOIN `orders` `o` ON `o`.`id` = `oi`.`order_id`
WHERE `o`.`status_pesanan` = 'selesai'
AND `p`.`deleted_at` IS NULL
GROUP BY `p`.`id`
ORDER BY `total_terjual` DESC
 LIMIT 10