app/Models/StoreInfoModel.php

SELECT *
FROM `store_info`
 LIMIT 1
---
    public function getInfo(): ?array
    {
        return $this->first();